balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F65K80.PIC
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO8" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO8" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0_FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1_FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2_FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FP1" edc:desc="" edc:mask="0x1" edc:name="FP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FP2" edc:desc="" edc:mask="0x1" edc:name="FP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FP3" edc:desc="" edc:mask="0x1" edc:name="FP3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrnnnn" edc:cname="B2CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="B2CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0_TXPRI0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0/TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1_TXPRI1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1/TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2_RTREN" edc:desc="" edc:mask="0x1" edc:name="FILHIT2/RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3_TXREQ" edc:desc="" edc:mask="0x1" edc:name="FILHIT3/TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4_TXERR" edc:desc="" edc:mask="0x1" edc:name="FILHIT4/TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO/TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1_TXABT" edc:desc="" edc:mask="0x1" edc:name="RXM1/TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL_TXBIF" edc:desc="" edc:mask="0x1" edc:name="RXFUL/TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="FILHIT0_TXPRI0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0_TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1_TXPRI1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1_TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2_RTREN" edc:desc="" edc:mask="0x1" edc:name="FILHIT2_RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3_TXREQ" edc:desc="" edc:mask="0x1" edc:name="FILHIT3_TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4_TXERR" edc:desc="" edc:mask="0x1" edc:name="FILHIT4_TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO_TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1_TXABT" edc:desc="" edc:mask="0x1" edc:name="RXM1_TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL_TXBIF" edc:desc="" edc:mask="0x1" edc:name="RXFUL_TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBIF" edc:desc="" edc:mask="0x1" edc:name="TXBIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
